In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("../learning/Data/public_spending_data.csv")
df.head()

,age,gender,major,monthly_income,stationary,food,shoping,friends,entertainment,personal,others,mode
0,19,Non-binary,Psychology,958,188,296,709,123,41,78,72,Credit/Debit Card
1,24,1,Economics,1006,252,365,557,85,74,92,68,Credit/Debit Card
2,24,Non-binary,Economics,734,99,220,666,137,130,23,133,0
3,23,1,Computer Science,617,223,289,652,114,99,30,55,1
4,20,1,Computer Science,810,194,372,825,168,48,71,104,Credit/Debit Card

In [3]:
# 1. Identify the rows that have 'Credit/Debit Card'
mask = df['mode'] == 'Credit/Debit Card'
target_indices = df[mask].index.tolist()

# 2. Shuffle the indices randomly
np.random.seed(42)
np.random.shuffle(target_indices)

# 3. Split the list in half
midpoint = len(target_indices) // 2
zeros_indices = target_indices[:midpoint]
ones_indices = target_indices[midpoint:]

# 4. Assign the new values
df.loc[zeros_indices, 'mode'] = 0
df.loc[ones_indices, 'mode'] = 1

# 5. Convert the column to numeric (since it's now all 0s and 1s)
df['mode'] = df['mode'].astype(int)

In [4]:
# 1. Identify the rows that have 'Credit/Debit Card'
mask = df['gender'] == 'Non-binary'
target_indices = df[mask].index.tolist()

# 2. Shuffle the indices randomly
np.random.seed(42)
np.random.shuffle(target_indices)

# 3. Split the list in half
midpoint = len(target_indices) // 2
zeros_indices = target_indices[:midpoint]
ones_indices = target_indices[midpoint:]

# 4. Assign the new values
df.loc[zeros_indices, 'gender'] = 0
df.loc[ones_indices, 'gender'] = 1

# 5. Convert the column to numeric (since it's now all 0s and 1s)
df['gender'] = df['gender'].astype(int)

In [5]:
df.head()

,age,gender,major,monthly_income,stationary,food,shoping,friends,entertainment,personal,others,mode
0,19,1,Psychology,958,188,296,709,123,41,78,72,1
1,24,1,Economics,1006,252,365,557,85,74,92,68,1
2,24,1,Economics,734,99,220,666,137,130,23,133,0
3,23,1,Computer Science,617,223,289,652,114,99,30,55,1
4,20,1,Computer Science,810,194,372,825,168,48,71,104,1

In [12]:
df.describe()

,age,gender,monthly_income,stationary,food,shoping,friends,entertainment,personal,others,mode
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000
mean,21.675000,0.484000,2041.300000,262.141500,315.802500,1566.013500,747.822000,169.628000,606.990000,217.820000,0.52000
std,2.322664,0.499994,587.682323,108.606778,108.687008,385.241895,261.347943,75.940902,228.980069,104.824443,0.49985
min,18.000000,0.000000,1002.000000,75.000000,125.000000,902.250000,300.000000,40.000000,200.000000,40.000000,0.00000
25%,20.000000,0.000000,1541.500000,168.000000,218.750000,1212.187500,528.000000,108.000000,410.000000,127.500000,0.00000
50%,22.000000,0.000000,2042.000000,262.500000,318.750000,1585.125000,738.000000,172.000000,620.000000,220.000000,1.00000
75%,24.000000,1.000000,2576.500000,357.000000,412.500000,1883.812500,973.500000,232.000000,800.000000,306.000000,1.00000
max,25.000000,1.000000,3000.000000,450.000000,500.000000,2250.000000,1200.000000,300.000000,1000.000000,400.000000,1.00000

In [9]:
df['monthly_income'] = df['monthly_income']*2

In [11]:
df['stationary'] = df['stationary']*1.5
df['food'] = df['food']*1.25
df['shoping'] = df['shoping']*2.25
df['friends'] = df['friends']*6
df['entertainment'] = df['entertainment']*2
df['personal'] = df['personal']*10
df['others'] = df['others']*2

In [15]:
df['spent'] = df['food'] + df['entertainment'] + df['friends'] + df['others'] + df['personal'] + df['shoping'] +df['stationary']

In [16]:
df.head()

,age,gender,major,monthly_income,stationary,food,shoping,friends,entertainment,personal,others,mode,spent
0,19,1,Psychology,1916,282.0,370.00,1595.25,738,82,780,144,1,3991.25
1,24,1,Economics,2012,378.0,456.25,1253.25,510,148,920,136,1,3801.50
2,24,1,Economics,1468,148.5,275.00,1498.50,822,260,230,266,0,3500.00
3,23,1,Computer Science,1234,334.5,361.25,1467.00,684,198,300,110,1,3454.75
4,20,1,Computer Science,1620,291.0,465.00,1856.25,1008,96,710,208,1,4634.25

In [17]:
df.describe()

,age,gender,monthly_income,stationary,food,shoping,friends,entertainment,personal,others,mode,spent
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000
mean,21.675000,0.484000,2041.300000,262.141500,315.802500,1566.013500,747.822000,169.628000,606.990000,217.820000,0.52000,3886.217500
std,2.322664,0.499994,587.682323,108.606778,108.687008,385.241895,261.347943,75.940902,228.980069,104.824443,0.49985,565.070693
min,18.000000,0.000000,1002.000000,75.000000,125.000000,902.250000,300.000000,40.000000,200.000000,40.000000,0.00000,2328.750000
25%,20.000000,0.000000,1541.500000,168.000000,218.750000,1212.187500,528.000000,108.000000,410.000000,127.500000,0.00000,3499.000000
50%,22.000000,0.000000,2042.000000,262.500000,318.750000,1585.125000,738.000000,172.000000,620.000000,220.000000,1.00000,3871.500000
75%,24.000000,1.000000,2576.500000,357.000000,412.500000,1883.812500,973.500000,232.000000,800.000000,306.000000,1.00000,4297.875000
max,25.000000,1.000000,3000.000000,450.000000,500.000000,2250.000000,1200.000000,300.000000,1000.000000,400.000000,1.00000,5388.500000

In [23]:
df.rename(columns={'others':'other'}, inplace=True)

In [25]:
df.to_csv("../learning/Data/public_spending_final_data.csv", index=False)